public class Storekeeper extends Worker {
    /**
     * Принять товар <br>
     * Добавить товар в ассортимент магазина, уменьшить количество денег в магазине
     * или
     * изменить количество товара в магазине, уменьшить количество денег в магазине
     */
    public void acceptProduct(Product product) {

    }

    /**
     * Провести инвентаризацию
     * сравнить количество товара в системе с фактическим
     * если не сходится, то отредактировать
     */
    public void takeInventory() {

    }
}
